tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "neovim/neovim"
tap "railwaycat/emacsmacport"
tap "rigellute/tap"
tap "universal-ctags/universal-ctags"

brew "bat"
brew "cmake"
brew "coreutils"
brew "docker"
brew "fish"
brew "fswatch"
brew "fzf"
brew "gcc"
brew "gdb"
brew "git-delta"
brew "gnupg"
brew "highlight"
brew "hub"
brew "imagemagick"
brew "kubernetes-cli"
brew "lf"
brew "luarocks"
brew "ncurses"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "node"
brew "ocaml"
brew "opam"
brew "python"
brew "ranger"
brew "ripgrep"
brew "sl"
brew "starship"
brew "thefuck"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "winetricks"
brew "yarn"
brew "github/gh/gh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "railwaycat/emacsmacport/emacs-mac"
brew "rigellute/tap/spotify-tui"

# Mac App Store
brew "mas"
mas 'Amphetamine', id: 937984704

# Cask Apps
cask 'burp-suite'
cask 'daisydisk'
cask 'figma'
cask 'iterm2'
cask 'karabiner-elements'
cask 'notion'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'vscodium'
cask 'vivaldi'

# Fonts
cask "font-firacode-nerd-font"
